RT-Thread/rt-thread/bsp/msp432e401y-LaunchPad/libraries/msp432e4/inc/msp432e411y.h
typedef struct {                                    /*!< CRC Structure                                                         */
  __IO uint32_t  CTRL;                              /*!< CRC Control                                                           */
  __I  uint32_t  RESERVED2[3];
  __IO uint32_t  SEED;                              /*!< CRC SEED/Context                                                      */
  __IO uint32_t  DIN;                               /*!< CRC Data Input                                                        */
  __IO uint32_t  RSLTPP;                            /*!< CRC Post Processing Result                                            */
} CRC_Type;


/* ================================================================================ */
/* ================                     SHAMD5                     ================ */
/* ================================================================================ */


/**
  * @brief Register map for SHAMD5 peripheral (SHAMD5)
  */

typedef struct {                                    /*!< SHAMD5 Structure                                                      */
  __IO uint32_t  ODIGEST_A;                         /*!< SHA Outer Digest A                                                    */
  __IO uint32_t  ODIGEST_B;                         /*!< SHA Outer Digest B                                                    */
  __IO uint32_t  ODIGEST_C;                         /*!< SHA Outer Digest C                                                    */
  __IO uint32_t  ODIGEST_D;                         /*!< SHA Outer Digest D                                                    */
  __IO uint32_t  ODIGEST_E;                         /*!< SHA Outer Digest E                                                    */
  __IO uint32_t  ODIGEST_F;                         /*!< SHA Outer Digest F                                                    */
  __IO uint32_t  ODIGEST_G;                         /*!< SHA Outer Digest G                                                    */
  __IO uint32_t  ODIGEST_H;                         /*!< SHA Outer Digest H                                                    */
  __IO uint32_t  IDIGEST_A;                         /*!< SHA Inner Digest A                                                    */
  __IO uint32_t  IDIGEST_B;                         /*!< SHA Inner Digest B                                                    */
  __IO uint32_t  IDIGEST_C;                         /*!< SHA Inner Digest C                                                    */
  __IO uint32_t  IDIGEST_D;                         /*!< SHA Inner Digest D                                                    */
  __IO uint32_t  IDIGEST_E;                         /*!< SHA Inner Digest E                                                    */
  __IO uint32_t  IDIGEST_F;                         /*!< SHA Inner Digest F                                                    */
  __IO uint32_t  IDIGEST_G;                         /*!< SHA Inner Digest G                                                    */
  __IO uint32_t  IDIGEST_H;                         /*!< SHA Inner Digest H                                                    */
  __IO uint32_t  DIGEST_COUNT;                      /*!< SHA Digest Count                                                      */
  __IO uint32_t  MODE;                              /*!< SHA Mode                                                              */
  __IO uint32_t  LENGTH;                            /*!< SHA Length                                                            */
  __I  uint32_t  RESERVED0[13];
  __IO uint32_t  DATA_0_IN;                         /*!< SHA Data 0 Input                                                      */
  __IO uint32_t  DATA_1_IN;                         /*!< SHA Data 1 Input                                                      */
  __IO uint32_t  DATA_2_IN;                         /*!< SHA Data 2 Input                                                      */
  __IO uint32_t  DATA_3_IN;                         /*!< SHA Data 3 Input                                                      */
  __IO uint32_t  DATA_4_IN;                         /*!< SHA Data 4 Input                                                      */
  __IO uint32_t  DATA_5_IN;                         /*!< SHA Data 5 Input                                                      */
  __IO uint32_t  DATA_6_IN;                         /*!< SHA Data 6 Input                                                      */
  __IO uint32_t  DATA_7_IN;                         /*!< SHA Data 7 Input                                                      */
  __IO uint32_t  DATA_8_IN;                         /*!< SHA Data 8 Input                                                      */
  __IO uint32_t  DATA_9_IN;                         /*!< SHA Data 9 Input                                                      */
  __IO uint32_t  DATA_10_IN;                        /*!< SHA Data 10 Input                                                     */
  __IO uint32_t  DATA_11_IN;                        /*!< SHA Data 11 Input                                                     */
  __IO uint32_t  DATA_12_IN;                        /*!< SHA Data 12 Input                                                     */
  __IO uint32_t  DATA_13_IN;                        /*!< SHA Data 13 Input                                                     */
  __IO uint32_t  DATA_14_IN;                        /*!< SHA Data 14 Input                                                     */
  __IO uint32_t  DATA_15_IN;                        /*!< SHA Data 15 Input                                                     */
  __I  uint32_t  RESERVED1[16];
  __IO uint32_t  REVISION;                          /*!< SHA Revision                                                          */
  __I  uint32_t  RESERVED2[3];
  __IO uint32_t  SYSCONFIG;                         /*!< SHA System Configuration                                              */
  __IO uint32_t  SYSSTATUS;                         /*!< SHA System Status                                                     */
  __IO uint32_t  IRQSTATUS;                         /*!< SHA Interrupt Status                                                  */
  __IO uint32_t  IRQENABLE;                         /*!< SHA Interrupt Enable                                                  */
} SHAMD5_Type;

