RT-Thread/rt-thread/bsp/msp432e401y-LaunchPad/libraries/msp432e4/inc/msp432e411y.h
typedef struct {
  __IO uint32_t  DMAIM;                             /*!< SHA DMA Interrupt Mask                                                */
  __IO uint32_t  DMARIS;                            /*!< SHA DMA Raw Interrupt Status                                          */
  __IO uint32_t  DMAMIS;                            /*!< SHA DMA Masked Interrupt Status                                       */
  __IO uint32_t  DMAIC;                             /*!< SHA DMA Interrupt Clear                                               */
} SHAMD5_DMA_Type;

/* ================================================================================ */
/* ================                       AES                      ================ */
/* ================================================================================ */


/**
  * @brief Register map for AES peripheral (AES)
  */

typedef struct {                                    /*!< AES Structure                                                         */
  __IO uint32_t  KEY2_6;                            /*!< AES Key 2_6                                                           */
  __IO uint32_t  KEY2_7;                            /*!< AES Key 2_7                                                           */
  __IO uint32_t  KEY2_4;                            /*!< AES Key 2_4                                                           */
  __IO uint32_t  KEY2_5;                            /*!< AES Key 2_5                                                           */
  __IO uint32_t  KEY2_2;                            /*!< AES Key 2_2                                                           */
  __IO uint32_t  KEY2_3;                            /*!< AES Key 2_3                                                           */
  __IO uint32_t  KEY2_0;                            /*!< AES Key 2_0                                                           */
  __IO uint32_t  KEY2_1;                            /*!< AES Key 2_1                                                           */
  __IO uint32_t  KEY1_6;                            /*!< AES Key 1_6                                                           */
  __IO uint32_t  KEY1_7;                            /*!< AES Key 1_7                                                           */
  __IO uint32_t  KEY1_4;                            /*!< AES Key 1_4                                                           */
  __IO uint32_t  KEY1_5;                            /*!< AES Key 1_5                                                           */
  __IO uint32_t  KEY1_2;                            /*!< AES Key 1_2                                                           */
  __IO uint32_t  KEY1_3;                            /*!< AES Key 1_3                                                           */
  __IO uint32_t  KEY1_0;                            /*!< AES Key 1_0                                                           */
  __IO uint32_t  KEY1_1;                            /*!< AES Key 1_1                                                           */
  __IO uint32_t  IV_IN_0;                           /*!< AES Initialization Vector Input 0                                     */
  __IO uint32_t  IV_IN_1;                           /*!< AES Initialization Vector Input 1                                     */
  __IO uint32_t  IV_IN_2;                           /*!< AES Initialization Vector Input 2                                     */
  __IO uint32_t  IV_IN_3;                           /*!< AES Initialization Vector Input 3                                     */
  __IO uint32_t  CTRL;                              /*!< AES Control                                                           */
  __IO uint32_t  C_LENGTH_0;                        /*!< AES Crypto Data Length 0                                              */
  __IO uint32_t  C_LENGTH_1;                        /*!< AES Crypto Data Length 1                                              */
  __IO uint32_t  AUTH_LENGTH;                       /*!< AES Authentication Data Length                                        */
  __IO uint32_t  DATA_IN_0;                         /*!< AES Data RW Plaintext/Ciphertext 0                                    */
  __IO uint32_t  DATA_IN_1;                         /*!< AES Data RW Plaintext/Ciphertext 1                                    */
  __IO uint32_t  DATA_IN_2;                         /*!< AES Data RW Plaintext/Ciphertext 2                                    */
  __IO uint32_t  DATA_IN_3;                         /*!< AES Data RW Plaintext/Ciphertext 3                                    */
  __IO uint32_t  TAG_OUT_0;                         /*!< AES Hash Tag Out 0                                                    */
  __IO uint32_t  TAG_OUT_1;                         /*!< AES Hash Tag Out 1                                                    */
  __IO uint32_t  TAG_OUT_2;                         /*!< AES Hash Tag Out 2                                                    */
  __IO uint32_t  TAG_OUT_3;                         /*!< AES Hash Tag Out 3                                                    */
  __IO uint32_t  REVISION;                          /*!< AES IP Revision Identifier                                            */
  __IO uint32_t  SYSCONFIG;                         /*!< AES System Configuration                                              */
  __IO uint32_t  SYSSTATUS;                         /*!< AES System Status                                                     */
  __IO uint32_t  IRQSTATUS;                         /*!< AES Interrupt Status                                                  */
  __IO uint32_t  IRQENABLE;                         /*!< AES Interrupt Enable                                                  */
  __IO uint32_t  DIRTYBITS;                         /*!< AES Dirty Bits                                                        */
} AES_Type;

typedef struct {
  __IO uint32_t  DMAIM;                             /*!< AES DMA Interrupt Mask                                                */
  __IO uint32_t  DMARIS;                            /*!< AES DMA Raw Interrupt Status                                          */
  __IO uint32_t  DMAMIS;                            /*!< AES DMA Masked Interrupt Status                                       */
  __IO uint32_t  DMAIC;                             /*!< AES DMA Interrupt Clear                                               */
} AES_DMA_Type;

/* ================================================================================ */
/* ================                       DES                      ================ */
/* ================================================================================ */


/**
  * @brief Register map for DES peripheral (DES)
  */

